<a href="https://colab.research.google.com/github/King-Bowie/pandas-testando-e-analisando/blob/main/Pandas_testando_e_analisando.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas: Testando e analisando

<h3>Neste data base fomos contratados por uma empresa da área de imóveis, e no momento temos um DataFrame que será analisado e explorado para um relatório para o nosso chefe.

<h5>Este conteúdo é baseado no curso da Alura com o mesmo nome.
<h5>Os dados foram distribuídos pela Alura através do curso com o mesmo nome.

##Relatório de dados I : Descrição

In [ ]:
import pandas as pd
dados = pd.read_csv('https://raw.githubusercontent.com/King-Bowie/pandas-testando-e-analisando/main/dados/aluguel.csv', sep = ';')
dados.head()

                      Tipo           Bairro  ...  Condominio    IPTU
0                Quitinete       Copacabana  ...       500.0    60.0
1                     Casa  Jardim Botânico  ...         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca  ...      4020.0  1111.0
3              Apartamento           Centro  ...       390.0    20.0
4              Apartamento     Higienópolis  ...       230.0     NaN

[5 rows x 9 columns]

In [ ]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

###Informações gerais sobre a Base de Dados

In [ ]:
tipos_de_dados = pd.DataFrame(dados.dtypes, columns = ['Tipos de Dados'])
tipos_de_dados.columns.name = 'Variáveis'
tipos_de_dados

Variáveis     Tipos de Dados
Tipo                  object
Bairro                object
Quartos                int64
Vagas                  int64
Suites                 int64
Area                   int64
Valor                float64
Condominio           float64
IPTU                 float64
Valor m2             float64
Tipo Agregado         object

In [ ]:
dados.shape

(32960, 9)

In [ ]:
print(f'A base de dados apresenta {dados.shape[0]} registros (imóveis) e {dados.shape[1]} variáveis.')

A base de dados apresenta 32960 registros (imóveis) e 9 variáveis.

##Relatório de Análise II : Exploratória

In [ ]:
import pandas as pd
dados = pd.read_csv('https://raw.githubusercontent.com/King-Bowie/pandas-testando-e-analisando/main/dados/aluguel.csv', sep = ';')
dados

                          Tipo                Bairro  ...  Condominio    IPTU
0                    Quitinete            Copacabana  ...       500.0    60.0
1                         Casa       Jardim Botânico  ...         NaN     NaN
2      Conjunto Comercial/Sala       Barra da Tijuca  ...      4020.0  1111.0
3                  Apartamento                Centro  ...       390.0    20.0
4                  Apartamento          Higienópolis  ...       230.0     NaN
...                        ...                   ...  ...         ...     ...
32955                Quitinete                Centro  ...       350.0    25.0
32956              Apartamento           Jacarepaguá  ...       800.0    40.0
32957              Apartamento  São Francisco Xavier  ...       509.0    37.0
32958              Apartamento                Leblon  ...       760.0     NaN
32959  Conjunto Comercial/Sala                Centro  ...      4206.0  1109.0

[32960 rows x 9 columns]

In [ ]:
tipo_de_imovel = dados['Tipo']

In [ ]:
type(tipo_de_imovel)

pandas.core.series.Series

In [ ]:
tipo_de_imovel.drop_duplicates()  #vai eliminar as duplicatas por ordem que ele vê

0                          Quitinete
1                               Casa
2            Conjunto Comercial/Sala
3                        Apartamento
7                 Casa de Condomínio
16                    Prédio Inteiro
17                              Flat
29                        Loja/Salão
80           Galpão/Depósito/Armazém
83                    Casa Comercial
117                     Casa de Vila
159                   Terreno Padrão
207                      Box/Garagem
347                             Loft
589      Loja Shopping/ Ct Comercial
2157                         Chácara
3354           Loteamento/Condomínio
4379                           Sítio
4721                   Pousada/Chalé
6983                          Studio
9687                           Hotel
23614                      Indústria
Name: Tipo, dtype: object

In [ ]:
tipo_de_imovel.value_counts() #vai contar a ocorrencia de cada variável

Apartamento                    19532
Conjunto Comercial/Sala         6815
Loja/Salão                      1426
Casa de Condomínio               996
Casa                             967
Quitinete                        836
Galpão/Depósito/Armazém          623
Flat                             476
Prédio Inteiro                   301
Casa Comercial                   265
Casa de Vila                     249
Loja Shopping/ Ct Comercial      247
Box/Garagem                       82
Terreno Padrão                    70
Loft                              51
Sítio                             10
Loteamento/Condomínio              5
Studio                             4
Hotel                              2
Chácara                            1
Indústria                          1
Pousada/Chalé                      1
Name: Tipo, dtype: int64

In [ ]:
tipo_de_imovel.drop_duplicates(inplace=True) 
tipo_de_imovel

0                          Quitinete
1                               Casa
2            Conjunto Comercial/Sala
3                        Apartamento
7                 Casa de Condomínio
16                    Prédio Inteiro
17                              Flat
29                        Loja/Salão
80           Galpão/Depósito/Armazém
83                    Casa Comercial
117                     Casa de Vila
159                   Terreno Padrão
207                      Box/Garagem
347                             Loft
589      Loja Shopping/ Ct Comercial
2157                         Chácara
3354           Loteamento/Condomínio
4379                           Sítio
4721                   Pousada/Chalé
6983                          Studio
9687                           Hotel
23614                      Indústria
Name: Tipo, dtype: object

###Organizando visualização

In [ ]:
tipo_de_imovel = pd.DataFrame(tipo_de_imovel)
tipo_de_imovel

                              Tipo
0                        Quitinete
1                             Casa
2          Conjunto Comercial/Sala
3                      Apartamento
7               Casa de Condomínio
16                  Prédio Inteiro
17                            Flat
29                      Loja/Salão
80         Galpão/Depósito/Armazém
83                  Casa Comercial
117                   Casa de Vila
159                 Terreno Padrão
207                    Box/Garagem
347                           Loft
589    Loja Shopping/ Ct Comercial
2157                       Chácara
3354         Loteamento/Condomínio
4379                         Sítio
4721                 Pousada/Chalé
6983                        Studio
9687                         Hotel
23614                    Indústria

In [ ]:
tipo_de_imovel.index

Int64Index([    0,     1,     2,     3,     7,    16,    17,    29,    80,
               83,   117,   159,   207,   347,   589,  2157,  3354,  4379,
             4721,  6983,  9687, 23614],
           dtype='int64')

In [ ]:
tipo_de_imovel.shape[0]

22

In [ ]:
range(tipo_de_imovel.shape[0])

range(0, 22)

In [ ]:
for i in range(tipo_de_imovel.shape[0]):
  print(i)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21

In [ ]:
tipo_de_imovel.index = range(tipo_de_imovel.shape[0])
tipo_de_imovel

                           Tipo
0                     Quitinete
1                          Casa
2       Conjunto Comercial/Sala
3                   Apartamento
4            Casa de Condomínio
5                Prédio Inteiro
6                          Flat
7                    Loja/Salão
8       Galpão/Depósito/Armazém
9                Casa Comercial
10                 Casa de Vila
11               Terreno Padrão
12                  Box/Garagem
13                         Loft
14  Loja Shopping/ Ct Comercial
15                      Chácara
16        Loteamento/Condomínio
17                        Sítio
18                Pousada/Chalé
19                       Studio
20                        Hotel
21                    Indústria

In [ ]:
tipo_de_imovel.columns.name = 'Id'
tipo_de_imovel

Id                         Tipo
0                     Quitinete
1                          Casa
2       Conjunto Comercial/Sala
3                   Apartamento
4            Casa de Condomínio
5                Prédio Inteiro
6                          Flat
7                    Loja/Salão
8       Galpão/Depósito/Armazém
9                Casa Comercial
10                 Casa de Vila
11               Terreno Padrão
12                  Box/Garagem
13                         Loft
14  Loja Shopping/ Ct Comercial
15                      Chácara
16        Loteamento/Condomínio
17                        Sítio
18                Pousada/Chalé
19                       Studio
20                        Hotel
21                    Indústria

##Relatório de Análise III

In [ ]:
list(dados['Tipo'].drop_duplicates())

['Quitinete',
 'Casa',
 'Conjunto Comercial/Sala',
 'Apartamento',
 'Casa de Condomínio',
 'Prédio Inteiro',
 'Flat',
 'Loja/Salão',
 'Galpão/Depósito/Armazém',
 'Casa Comercial',
 'Casa de Vila',
 'Terreno Padrão',
 'Box/Garagem',
 'Loft',
 'Loja Shopping/ Ct Comercial',
 'Chácara',
 'Loteamento/Condomínio',
 'Sítio',
 'Pousada/Chalé',
 'Studio',
 'Hotel',
 'Indústria']

In [ ]:
residencial = [
 'Quitinete',
 'Casa',
 'Apartamento',
 'Casa de Condomínio',
 'Casa de Vila',
 ]
residencial

['Quitinete', 'Casa', 'Apartamento', 'Casa de Condomínio', 'Casa de Vila']

In [ ]:
dados['Tipo'].isin(residencial).head(10)

0     True
1     True
2    False
3     True
4     True
5     True
6     True
7     True
8     True
9    False
Name: Tipo, dtype: bool

In [ ]:
dados.head(10)

                      Tipo           Bairro  ...  Condominio    IPTU
0                Quitinete       Copacabana  ...       500.0    60.0
1                     Casa  Jardim Botânico  ...         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca  ...      4020.0  1111.0
3              Apartamento           Centro  ...       390.0    20.0
4              Apartamento     Higienópolis  ...       230.0     NaN
5              Apartamento     Vista Alegre  ...         NaN     NaN
6              Apartamento         Cachambi  ...       301.0    17.0
7       Casa de Condomínio  Barra da Tijuca  ...         NaN     NaN
8       Casa de Condomínio            Ramos  ...         NaN     NaN
9  Conjunto Comercial/Sala           Centro  ...     19193.0  3030.0

[10 rows x 9 columns]

In [ ]:
selecao = dados['Tipo'].isin(residencial)
selecao

0         True
1         True
2        False
3         True
4         True
         ...
32955     True
32956     True
32957     True
32958     True
32959    False
Name: Tipo, Length: 32960, dtype: bool

In [ ]:
dados_residencial = dados[selecao]
dados_residencial

              Tipo                Bairro  Quartos  ...   Valor  Condominio  IPTU
0        Quitinete            Copacabana        1  ...  1700.0       500.0  60.0
1             Casa       Jardim Botânico        2  ...  7000.0         NaN   NaN
3      Apartamento                Centro        1  ...   800.0       390.0  20.0
4      Apartamento          Higienópolis        1  ...   800.0       230.0   NaN
5      Apartamento          Vista Alegre        3  ...  1200.0         NaN   NaN
...            ...                   ...      ...  ...     ...         ...   ...
32953  Apartamento                 Méier        2  ...   900.0       490.0  48.0
32955    Quitinete                Centro        0  ...   800.0       350.0  25.0
32956  Apartamento           Jacarepaguá        3  ...  1800.0       800.0  40.0
32957  Apartamento  São Francisco Xavier        2  ...  1400.0       509.0  37.0
32958  Apartamento                Leblon        2  ...  3000.0       760.0   NaN

[22580 rows x 9 columns]

In [ ]:
print(f'Os total de registros é {dados.shape[0]} e por exemplo o total de registros residenciais é {dados_residencial.shape[0]}')

Os total de registros é 32960 e por exemplo o total de registros residenciais é 22580

In [ ]:
list(dados_residencial["Tipo"].drop_duplicates())

['Quitinete', 'Casa', 'Apartamento', 'Casa de Condomínio', 'Casa de Vila']

###Reconstruindo os índices do data frame de dados residenciais

In [ ]:
dados_residencial.index = range(dados_residencial.shape[0])
dados_residencial

              Tipo                Bairro  Quartos  ...   Valor  Condominio  IPTU
0        Quitinete            Copacabana        1  ...  1700.0       500.0  60.0
1             Casa       Jardim Botânico        2  ...  7000.0         NaN   NaN
2      Apartamento                Centro        1  ...   800.0       390.0  20.0
3      Apartamento          Higienópolis        1  ...   800.0       230.0   NaN
4      Apartamento          Vista Alegre        3  ...  1200.0         NaN   NaN
...            ...                   ...      ...  ...     ...         ...   ...
22575  Apartamento                 Méier        2  ...   900.0       490.0  48.0
22576    Quitinete                Centro        0  ...   800.0       350.0  25.0
22577  Apartamento           Jacarepaguá        3  ...  1800.0       800.0  40.0
22578  Apartamento  São Francisco Xavier        2  ...  1400.0       509.0  37.0
22579  Apartamento                Leblon        2  ...  3000.0       760.0   NaN

[22580 rows x 9 columns]

###Exportando a base de dados

Neste caso eu tive que criar uma pasta no colab para guardar este arquivo

In [ ]:
dados_residencial.to_csv('aluguel_residencial.csv', sep = ";")

In [ ]:
dados_residencial_2 = pd.read_csv('aluguel_residencial.csv', sep = ";")
dados_residencial_2

       Unnamed: 0         Tipo                Bairro  ...   Valor  Condominio  IPTU
0               0    Quitinete            Copacabana  ...  1700.0       500.0  60.0
1               1         Casa       Jardim Botânico  ...  7000.0         NaN   NaN
2               2  Apartamento                Centro  ...   800.0       390.0  20.0
3               3  Apartamento          Higienópolis  ...   800.0       230.0   NaN
4               4  Apartamento          Vista Alegre  ...  1200.0         NaN   NaN
...           ...          ...                   ...  ...     ...         ...   ...
22575       22575  Apartamento                 Méier  ...   900.0       490.0  48.0
22576       22576    Quitinete                Centro  ...   800.0       350.0  25.0
22577       22577  Apartamento           Jacarepaguá  ...  1800.0       800.0  40.0
22578       22578  Apartamento  São Francisco Xavier  ...  1400.0       509.0  37.0
22579       22579  Apartamento                Leblon  ...  3000.0       760.0   NaN

[22580 rows x 10 columns]

E então temos um problema no nosso índice que a biblioteca vai ler e entender como uma variável então devemos consertar (caso tenha porblema para ver o erro então comente a próxima linha)

In [ ]:
dados_residencial.to_csv('aluguel_residencial.csv', sep = ";", index=False)
dados_residencial_2 = pd.read_csv('aluguel_residencial.csv', sep = ";")
dados_residencial_2

              Tipo                Bairro  Quartos  ...   Valor  Condominio  IPTU
0        Quitinete            Copacabana        1  ...  1700.0       500.0  60.0
1             Casa       Jardim Botânico        2  ...  7000.0         NaN   NaN
2      Apartamento                Centro        1  ...   800.0       390.0  20.0
3      Apartamento          Higienópolis        1  ...   800.0       230.0   NaN
4      Apartamento          Vista Alegre        3  ...  1200.0         NaN   NaN
...            ...                   ...      ...  ...     ...         ...   ...
22575  Apartamento                 Méier        2  ...   900.0       490.0  48.0
22576    Quitinete                Centro        0  ...   800.0       350.0  25.0
22577  Apartamento           Jacarepaguá        3  ...  1800.0       800.0  40.0
22578  Apartamento  São Francisco Xavier        2  ...  1400.0       509.0  37.0
22579  Apartamento                Leblon        2  ...  3000.0       760.0   NaN

[22580 rows x 9 columns]

##Relatório de Análise IV

###Seleções e frequências 
<li>Selecione somente os imóveis classificados com tipo "Apartamento"
<li>Selecione os imóveis classificados com tipos "Casa", "Casa de Condomínio" e "Casa de Vila"
<li>Selecione os imóveis com area entre 60 e 100 metros quadrados, incluindo os limites
<li>Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00

In [ ]:
dados_residencial_2.head()

          Tipo           Bairro  Quartos  Vagas  ...  Area   Valor  Condominio  IPTU
0    Quitinete       Copacabana        1      0  ...    40  1700.0       500.0  60.0
1         Casa  Jardim Botânico        2      0  ...   100  7000.0         NaN   NaN
2  Apartamento           Centro        1      0  ...    15   800.0       390.0  20.0
3  Apartamento     Higienópolis        1      0  ...    48   800.0       230.0   NaN
4  Apartamento     Vista Alegre        3      1  ...    70  1200.0         NaN   NaN

[5 rows x 9 columns]

In [ ]:
selecao_apartamento = dados_residencial_2['Tipo'] == 'Apartamento'
n1 = dados_residencial_2[selecao_apartamento]  
n1

              Tipo                Bairro  Quartos  ...   Valor  Condominio  IPTU
2      Apartamento                Centro        1  ...   800.0       390.0  20.0
3      Apartamento          Higienópolis        1  ...   800.0       230.0   NaN
4      Apartamento          Vista Alegre        3  ...  1200.0         NaN   NaN
5      Apartamento              Cachambi        2  ...  1300.0       301.0  17.0
8      Apartamento                Centro        1  ...  1200.0         NaN   NaN
...            ...                   ...      ...  ...     ...         ...   ...
22573  Apartamento        Vila Valqueire        2  ...  1000.0       550.0   NaN
22575  Apartamento                 Méier        2  ...   900.0       490.0  48.0
22577  Apartamento           Jacarepaguá        3  ...  1800.0       800.0  40.0
22578  Apartamento  São Francisco Xavier        2  ...  1400.0       509.0  37.0
22579  Apartamento                Leblon        2  ...  3000.0       760.0   NaN

[19532 rows x 9 columns]

In [ ]:
#Selecione somente os imóveis classificados com tipo 'Apartamento'
n1 = n1.shape[0]

In [ ]:
#Selecione os imóveis classificados com tipos "Casa", "Casa de Condomínio" e "Casa de Vila"
selecao_casa = (dados_residencial_2['Tipo'] == "Casa") | (dados_residencial_2['Tipo'] == "Casa de Condomínio") | (dados_residencial_2['Tipo'] == "Casa de Vila")
n2 = dados_residencial_2[selecao_casa]
n2 = n2.shape[0]

In [ ]:
#Selecione os imóveis com area entre 60 e 100 metros quadrados, incluindo os limites
selecao_metros = (dados_residencial_2["Area"] >= 60) & (dados_residencial_2["Area"] <= 100)
n3 = dados_residencial_2[selecao_metros].shape[0]
n3

8719

In [ ]:
#Selecione os imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00
selecao_quartos = (dados_residencial_2["Quartos"] >= 4) & (dados_residencial_2["Valor"] < 2000)
n4 = dados_residencial_2[selecao_quartos].shape[0]
n4

41

In [ ]:
print(f"Nº de imóveis classificados com tipo 'Apartamento' -> {n1} ")
print(f"Nº de imóveis classificados com tipos 'Casa', 'Casa de Condomínio', 'Casa de Vila' -> {n2}")
print(f"Nº de  imóveis com área entre 60 e 100 metros quadrados, incluido os limites -> {n3}")
print(f"Nº de  imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00 -> {n4}")

Nº de imóveis classificados com tipo 'Apartamento' -> 19532
Nº de imóveis classificados com tipos 'Casa', 'Casa de Condomínio', 'Casa de Vila' -> 2212
Nº de  imóveis com área entre 60 e 100 metros quadrados, incluido os limites -> 8719
Nº de  imóveis que tenham pelo menos 4 quartos e aluguel menor que R$ 2.000,00 -> 41

##Relatório de Análise V

###Tratamento de dados faltantes

In [ ]:
dados_residencial_2.head()

          Tipo           Bairro  Quartos  Vagas  ...  Area   Valor  Condominio  IPTU
0    Quitinete       Copacabana        1      0  ...    40  1700.0       500.0  60.0
1         Casa  Jardim Botânico        2      0  ...   100  7000.0         NaN   NaN
2  Apartamento           Centro        1      0  ...    15   800.0       390.0  20.0
3  Apartamento     Higienópolis        1      0  ...    48   800.0       230.0   NaN
4  Apartamento     Vista Alegre        3      1  ...    70  1200.0         NaN   NaN

[5 rows x 9 columns]

In [ ]:
dados_residencial_2.isnull()

        Tipo  Bairro  Quartos  Vagas  Suites   Area  Valor  Condominio   IPTU
0      False   False    False  False   False  False  False       False  False
1      False   False    False  False   False  False  False        True   True
2      False   False    False  False   False  False  False       False  False
3      False   False    False  False   False  False  False       False   True
4      False   False    False  False   False  False  False        True   True
...      ...     ...      ...    ...     ...    ...    ...         ...    ...
22575  False   False    False  False   False  False  False       False  False
22576  False   False    False  False   False  False  False       False  False
22577  False   False    False  False   False  False  False       False  False
22578  False   False    False  False   False  False  False       False  False
22579  False   False    False  False   False  False  False       False   True

[22580 rows x 9 columns]

In [ ]:
dados_residencial_2.notnull()

       Tipo  Bairro  Quartos  Vagas  Suites  Area  Valor  Condominio   IPTU
0      True    True     True   True    True  True   True        True   True
1      True    True     True   True    True  True   True       False  False
2      True    True     True   True    True  True   True        True   True
3      True    True     True   True    True  True   True        True  False
4      True    True     True   True    True  True   True       False  False
...     ...     ...      ...    ...     ...   ...    ...         ...    ...
22575  True    True     True   True    True  True   True        True   True
22576  True    True     True   True    True  True   True        True   True
22577  True    True     True   True    True  True   True        True   True
22578  True    True     True   True    True  True   True        True   True
22579  True    True     True   True    True  True   True        True  False

[22580 rows x 9 columns]

In [ ]:
dados_residencial_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22580 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        22580 non-null  object
 1   Bairro      22580 non-null  object
 2   Quartos     22580 non-null  int64
 3   Vagas       22580 non-null  int64
 4   Suites      22580 non-null  int64
 5   Area        22580 non-null  int64
 6   Valor       22571 non-null  float64
 7   Condominio  20765 non-null  float64
 8   IPTU        15795 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.6+ MB

In [ ]:
dados_residencial_2[dados_residencial_2["Valor"].isnull()]

             Tipo           Bairro  Quartos  ...  Valor  Condominio   IPTU
58    Apartamento  Barra da Tijuca        2  ...    NaN       970.0   68.0
1492  Apartamento             Leme        2  ...    NaN       878.0    NaN
1683         Casa     Campo Grande        3  ...    NaN         NaN    NaN
2012  Apartamento         Botafogo        2  ...    NaN      1010.0  170.0
2034  Apartamento       Copacabana        2  ...    NaN       850.0    NaN
4941         Casa     Campo Grande        3  ...    NaN         NaN    NaN
8568  Apartamento             Leme        2  ...    NaN       878.0    NaN
8947  Apartamento           Glória        3  ...    NaN       910.0  228.0
9149  Apartamento            Gávea        3  ...    NaN       880.0  221.0

[9 rows x 9 columns]

In [ ]:
A = dados_residencial_2.shape[0]
dados_residencial_2.dropna(subset = ['Valor'], inplace=True)
B = dados_residencial_2.shape[0]
A-B

9

In [ ]:
dados_residencial_2[dados_residencial_2["Valor"].isnull()]

Empty DataFrame
Columns: [Tipo, Bairro, Quartos, Vagas, Suites, Area, Valor, Condominio, IPTU]
Index: []

###Tratamento condicional

In [ ]:
dados_residencial_2[dados_residencial_2["Condominio"].isnull()].shape[0]

1813

In [ ]:
selecao_condominio = (dados_residencial_2["Tipo"]=='Apartamento') & (dados_residencial_2['Condominio'].isnull())

In [ ]:
C = dados_residencial_2.shape[0]
dados_residencial_2 = dados_residencial_2[~selecao_condominio]
D = dados_residencial_2.shape[0]
C-D

745

In [ ]:
dados_residencial_2[dados_residencial_2["Condominio"].isnull()].shape[0]

1068

In [ ]:
dados_residencial_3 = dados_residencial_2.fillna({'Condominio': 0, "IPTU" : 0})

In [ ]:
dados_residencial_3[dados_residencial_3["Condominio"].isnull()].shape[0]

0

In [ ]:
dados_residencial_3[dados_residencial_3["IPTU"].isnull()].shape[0]

0

In [ ]:
dados_residencial_3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21826 entries, 0 to 22579
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        21826 non-null  object
 1   Bairro      21826 non-null  object
 2   Quartos     21826 non-null  int64
 3   Vagas       21826 non-null  int64
 4   Suites      21826 non-null  int64
 5   Area        21826 non-null  int64
 6   Valor       21826 non-null  float64
 7   Condominio  21826 non-null  float64
 8   IPTU        21826 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 1.7+ MB

In [ ]:
dados_residencial_3.to_csv('aluguel_residencial.csv', sep = ';', index=False)

##Relatório de análise VI

###Criando novas variáveis

In [ ]:
novas_variaveis = pd.read_csv('aluguel_residencial.csv', sep=';')

In [ ]:
novas_variaveis

              Tipo                Bairro  Quartos  ...   Valor  Condominio  IPTU
0        Quitinete            Copacabana        1  ...  1700.0       500.0  60.0
1             Casa       Jardim Botânico        2  ...  7000.0         0.0   0.0
2      Apartamento                Centro        1  ...   800.0       390.0  20.0
3      Apartamento          Higienópolis        1  ...   800.0       230.0   0.0
4      Apartamento              Cachambi        2  ...  1300.0       301.0  17.0
...            ...                   ...      ...  ...     ...         ...   ...
21821  Apartamento                 Méier        2  ...   900.0       490.0  48.0
21822    Quitinete                Centro        0  ...   800.0       350.0  25.0
21823  Apartamento           Jacarepaguá        3  ...  1800.0       800.0  40.0
21824  Apartamento  São Francisco Xavier        2  ...  1400.0       509.0  37.0
21825  Apartamento                Leblon        2  ...  3000.0       760.0   0.0

[21826 rows x 9 columns]

In [ ]:
novas_variaveis['Valor Bruto'] = novas_variaveis['Valor'] + novas_variaveis['Condominio'] + novas_variaveis['IPTU']
novas_variaveis

              Tipo                Bairro  ...  IPTU  Valor Bruto
0        Quitinete            Copacabana  ...  60.0       2260.0
1             Casa       Jardim Botânico  ...   0.0       7000.0
2      Apartamento                Centro  ...  20.0       1210.0
3      Apartamento          Higienópolis  ...   0.0       1030.0
4      Apartamento              Cachambi  ...  17.0       1618.0
...            ...                   ...  ...   ...          ...
21821  Apartamento                 Méier  ...  48.0       1438.0
21822    Quitinete                Centro  ...  25.0       1175.0
21823  Apartamento           Jacarepaguá  ...  40.0       2640.0
21824  Apartamento  São Francisco Xavier  ...  37.0       1946.0
21825  Apartamento                Leblon  ...   0.0       3760.0

[21826 rows x 10 columns]

In [ ]:
novas_variaveis['Valor m2'] = novas_variaveis['Valor'] / novas_variaveis['Area']
novas_variaveis

              Tipo                Bairro  Quartos  ...  IPTU  Valor Bruto   Valor m2
0        Quitinete            Copacabana        1  ...  60.0       2260.0  42.500000
1             Casa       Jardim Botânico        2  ...   0.0       7000.0  70.000000
2      Apartamento                Centro        1  ...  20.0       1210.0  53.333333
3      Apartamento          Higienópolis        1  ...   0.0       1030.0  16.666667
4      Apartamento              Cachambi        2  ...  17.0       1618.0  26.000000
...            ...                   ...      ...  ...   ...          ...        ...
21821  Apartamento                 Méier        2  ...  48.0       1438.0  12.857143
21822    Quitinete                Centro        0  ...  25.0       1175.0  29.629630
21823  Apartamento           Jacarepaguá        3  ...  40.0       2640.0  23.076923
21824  Apartamento  São Francisco Xavier        2  ...  37.0       1946.0  29.166667
21825  Apartamento                Leblon        2  ...   0.0       3760.0  42.857143

[21826 rows x 11 columns]

In [ ]:
novas_variaveis['Valor m2'] = novas_variaveis['Valor m2'].round(2)
novas_variaveis

              Tipo                Bairro  Quartos  ...  IPTU  Valor Bruto  Valor m2
0        Quitinete            Copacabana        1  ...  60.0       2260.0     42.50
1             Casa       Jardim Botânico        2  ...   0.0       7000.0     70.00
2      Apartamento                Centro        1  ...  20.0       1210.0     53.33
3      Apartamento          Higienópolis        1  ...   0.0       1030.0     16.67
4      Apartamento              Cachambi        2  ...  17.0       1618.0     26.00
...            ...                   ...      ...  ...   ...          ...       ...
21821  Apartamento                 Méier        2  ...  48.0       1438.0     12.86
21822    Quitinete                Centro        0  ...  25.0       1175.0     29.63
21823  Apartamento           Jacarepaguá        3  ...  40.0       2640.0     23.08
21824  Apartamento  São Francisco Xavier        2  ...  37.0       1946.0     29.17
21825  Apartamento                Leblon        2  ...   0.0       3760.0     42.86

[21826 rows x 11 columns]

In [ ]:
novas_variaveis['Valor Bruto m2'] = (novas_variaveis['Valor Bruto'] / novas_variaveis['Area']).round(2)
novas_variaveis

              Tipo                Bairro  ...  Valor m2  Valor Bruto m2
0        Quitinete            Copacabana  ...     42.50           56.50
1             Casa       Jardim Botânico  ...     70.00           70.00
2      Apartamento                Centro  ...     53.33           80.67
3      Apartamento          Higienópolis  ...     16.67           21.46
4      Apartamento              Cachambi  ...     26.00           32.36
...            ...                   ...  ...       ...             ...
21821  Apartamento                 Méier  ...     12.86           20.54
21822    Quitinete                Centro  ...     29.63           43.52
21823  Apartamento           Jacarepaguá  ...     23.08           33.85
21824  Apartamento  São Francisco Xavier  ...     29.17           40.54
21825  Apartamento                Leblon  ...     42.86           53.71

[21826 rows x 12 columns]

In [ ]:
casa = ['Casa', 'Casa de Vila', 'Casa de Condomínio']
novas_variaveis['Tipo Agregado'] = novas_variaveis['Tipo'].apply(lambda x: 'Casa' if x in casa else 'Apartamento')
novas_variaveis

              Tipo                Bairro  ...  Valor Bruto m2  Tipo Agregado
0        Quitinete            Copacabana  ...           56.50    Apartamento
1             Casa       Jardim Botânico  ...           70.00           Casa
2      Apartamento                Centro  ...           80.67    Apartamento
3      Apartamento          Higienópolis  ...           21.46    Apartamento
4      Apartamento              Cachambi  ...           32.36    Apartamento
...            ...                   ...  ...             ...            ...
21821  Apartamento                 Méier  ...           20.54    Apartamento
21822    Quitinete                Centro  ...           43.52    Apartamento
21823  Apartamento           Jacarepaguá  ...           33.85    Apartamento
21824  Apartamento  São Francisco Xavier  ...           40.54    Apartamento
21825  Apartamento                Leblon  ...           53.71    Apartamento

[21826 rows x 13 columns]

###Excluir variáveis

In [ ]:
dados_aux = pd.DataFrame(novas_variaveis[['Tipo Agregado', 'Valor m2', 'Valor Bruto', 'Valor Bruto m2']])
dados_aux

      Tipo Agregado  Valor m2  Valor Bruto  Valor Bruto m2
0       Apartamento     42.50       2260.0           56.50
1              Casa     70.00       7000.0           70.00
2       Apartamento     53.33       1210.0           80.67
3       Apartamento     16.67       1030.0           21.46
4       Apartamento     26.00       1618.0           32.36
...             ...       ...          ...             ...
21821   Apartamento     12.86       1438.0           20.54
21822   Apartamento     29.63       1175.0           43.52
21823   Apartamento     23.08       2640.0           33.85
21824   Apartamento     29.17       1946.0           40.54
21825   Apartamento     42.86       3760.0           53.71

[21826 rows x 4 columns]

In [ ]:
del dados_aux['Valor Bruto']
dados_aux

      Tipo Agregado  Valor m2  Valor Bruto m2
0       Apartamento     42.50           56.50
1              Casa     70.00           70.00
2       Apartamento     53.33           80.67
3       Apartamento     16.67           21.46
4       Apartamento     26.00           32.36
...             ...       ...             ...
21821   Apartamento     12.86           20.54
21822   Apartamento     29.63           43.52
21823   Apartamento     23.08           33.85
21824   Apartamento     29.17           40.54
21825   Apartamento     42.86           53.71

[21826 rows x 3 columns]

In [ ]:
dados_aux.pop('Valor Bruto m2')

0        56.50
1        70.00
2        80.67
3        21.46
4        32.36
         ...
21821    20.54
21822    43.52
21823    33.85
21824    40.54
21825    53.71
Name: Valor Bruto m2, Length: 21826, dtype: float64

In [ ]:
dados_aux

      Tipo Agregado  Valor m2
0       Apartamento     42.50
1              Casa     70.00
2       Apartamento     53.33
3       Apartamento     16.67
4       Apartamento     26.00
...             ...       ...
21821   Apartamento     12.86
21822   Apartamento     29.63
21823   Apartamento     23.08
21824   Apartamento     29.17
21825   Apartamento     42.86

[21826 rows x 2 columns]

In [ ]:
novas_variaveis.drop(['Valor Bruto', 'Valor Bruto m2'],axis = 1, inplace = True)
novas_variaveis.head()

          Tipo           Bairro  Quartos  ...  IPTU  Valor m2  Tipo Agregado
0    Quitinete       Copacabana        1  ...  60.0     42.50    Apartamento
1         Casa  Jardim Botânico        2  ...   0.0     70.00           Casa
2  Apartamento           Centro        1  ...  20.0     53.33    Apartamento
3  Apartamento     Higienópolis        1  ...   0.0     16.67    Apartamento
4  Apartamento         Cachambi        2  ...  17.0     26.00    Apartamento

[5 rows x 11 columns]

In [ ]:
novas_variaveis.to_csv('aluguel_residencial.csv', sep = ";", index = False)

##Relatório de análise VII

###Criando Agrupamentos

In [ ]:
novas_variaveis = pd.read_csv('aluguel_residencial.csv', sep = ";")

In [ ]:
novas_variaveis.head()

          Tipo           Bairro  Quartos  ...  IPTU  Valor m2  Tipo Agregado
0    Quitinete       Copacabana        1  ...  60.0     42.50    Apartamento
1         Casa  Jardim Botânico        2  ...   0.0     70.00           Casa
2  Apartamento           Centro        1  ...  20.0     53.33    Apartamento
3  Apartamento     Higienópolis        1  ...   0.0     16.67    Apartamento
4  Apartamento         Cachambi        2  ...  17.0     26.00    Apartamento

[5 rows x 11 columns]

In [ ]:
novas_variaveis['Valor'].mean()

5046.172821405663

In [ ]:
bairros = ['Barra da Tijuca','Copacabana','Ipanema','Leblon', 'Botafogo', 'Flamengo', 'Tijuca']
selecao_bairro = novas_variaveis['Bairro'].isin(bairros)
novas_variaveis = novas_variaveis[selecao_bairro]
novas_variaveis

                     Tipo           Bairro  ...  Valor m2  Tipo Agregado
0               Quitinete       Copacabana  ...     42.50    Apartamento
5      Casa de Condomínio  Barra da Tijuca  ...     29.33           Casa
9             Apartamento       Copacabana  ...     50.00    Apartamento
10              Quitinete       Copacabana  ...     66.67    Apartamento
11            Apartamento       Copacabana  ...     53.50    Apartamento
...                   ...              ...  ...       ...            ...
21816         Apartamento           Leblon  ...     37.50    Apartamento
21817         Apartamento          Ipanema  ...    100.00    Apartamento
21818         Apartamento           Tijuca  ...     35.71    Apartamento
21820  Casa de Condomínio  Barra da Tijuca  ...     33.33           Casa
21825         Apartamento           Leblon  ...     42.86    Apartamento

[12216 rows x 11 columns]

In [ ]:
novas_variaveis['Bairro'].unique()

array(['Copacabana', 'Barra da Tijuca', 'Tijuca', 'Ipanema', 'Botafogo',
       'Leblon', 'Flamengo'], dtype=object)

In [ ]:
grupo_bairro = novas_variaveis.groupby('Bairro')

In [ ]:
type(grupo_bairro)

pandas.core.groupby.generic.DataFrameGroupBy

In [ ]:
grupo_bairro.groups

{'Barra da Tijuca': [5, 14, 16, 21, 30, 32, 35, 42, 43, 60, 61, 64, 68, 74, 79, 93, 107, 110, 112, 117, 130, 132, 136, 150, 153, 155, 165, 166, 173, 186, 189, 207, 214, 221, 224, 233, 236, 239, 244, 259, 265, 274, 276, 291, 292, 293, 295, 302, 308, 311, 325, 335, 336, 345, 360, 366, 368, 374, 380, 387, 389, 400, 412, 432, 433, 435, 436, 439, 449, 451, 462, 463, 465, 473, 476, 484, 494, 500, 503, 511, 537, 538, 539, 540, 543, 547, 552, 554, 555, 556, 584, 587, 588, 590, 594, 596, 601, 611, 622, 630, ...], 'Botafogo': [23, 48, 87, 88, 111, 119, 127, 134, 196, 200, 225, 334, 362, 415, 416, 498, 524, 526, 545, 593, 649, 685, 719, 756, 765, 822, 827, 861, 915, 924, 928, 1006, 1043, 1080, 1091, 1110, 1116, 1127, 1140, 1165, 1201, 1205, 1223, 1250, 1282, 1295, 1304, 1317, 1348, 1383, 1414, 1419, 1455, 1517, 1529, 1579, 1630, 1655, 1670, 1699, 1741, 1742, 1788, 1814, 1823, 1826, 1853, 1922, 1931, 1957, 1972, 1981, 1989, 2029, 2066, 2069, 2081, 2083, 2084, 2088, 2097, 2148, 2149, 2165, 2179, 2197, 2242, 2247, 2297, 2352, 2381, 2396, 2413, 2431, 2433, 2470, 2509, 2519, 2532, 2580, ...], 'Copacabana': [0, 9, 10, 11, 24, 25, 28, 31, 86, 91, 104, 109, 125, 129, 140, 142, 143, 151, 162, 174, 184, 192, 194, 206, 223, 249, 263, 275, 278, 281, 289, 290, 301, 307, 319, 327, 329, 348, 359, 365, 371, 372, 388, 396, 404, 425, 426, 437, 458, 460, 485, 486, 487, 497, 530, 532, 534, 557, 564, 573, 574, 583, 606, 610, 612, 615, 633, 650, 659, 666, 667, 678, 687, 689, 694, 701, 713, 730, 736, 739, 772, 808, 824, 836, 872, 881, 894, 898, 907, 912, 917, 919, 921, 922, 929, 952, 963, 964, 980, 989, ...], 'Flamengo': [78, 138, 218, 284, 321, 347, 356, 361, 369, 393, 421, 430, 442, 477, 544, 580, 620, 669, 726, 764, 795, 855, 886, 891, 900, 943, 967, 1044, 1099, 1128, 1137, 1209, 1234, 1241, 1359, 1397, 1400, 1507, 1513, 1525, 1536, 1546, 1555, 1602, 1605, 1680, 1696, 1760, 1763, 1834, 1844, 1872, 1940, 1973, 2005, 2010, 2035, 2218, 2227, 2264, 2274, 2311, 2334, 2362, 2374, 2426, 2461, 2529, 2530, 2539, 2542, 2567, 2594, 2626, 2637, 2702, 2710, 2715, 2773, 2777, 2863, 2877, 2920, 2937, 2955, 2975, 3036, 3087, 3102, 3127, 3129, 3138, 3175, 3259, 3284, 3317, 3393, 3399, 3411, 3420, ...], 'Ipanema': [19, 39, 40, 45, 52, 53, 73, 84, 92, 114, 121, 128, 141, 159, 177, 179, 216, 217, 230, 242, 245, 269, 283, 326, 338, 341, 370, 377, 386, 392, 405, 444, 482, 489, 515, 523, 535, 569, 575, 576, 577, 579, 589, 591, 614, 624, 628, 647, 648, 656, 671, 681, 690, 708, 710, 717, 725, 729, 731, 746, 747, 753, 757, 779, 783, 792, 800, 810, 812, 816, 829, 859, 860, 877, 888, 905, 906, 923, 927, 938, 951, 953, 970, 983, 985, 994, 1001, 1010, 1022, 1027, 1033, 1049, 1050, 1052, 1054, 1058, 1060, 1078, 1086, 1092, ...], 'Leblon': [27, 59, 90, 97, 115, 133, 161, 167, 171, 213, 219, 248, 314, 315, 324, 352, 353, 395, 407, 420, 443, 448, 459, 464, 466, 470, 490, 496, 501, 509, 519, 550, 597, 599, 603, 639, 640, 658, 686, 703, 711, 733, 749, 775, 784, 819, 828, 833, 834, 839, 843, 868, 874, 899, 931, 933, 945, 959, 965, 1053, 1059, 1069, 1070, 1072, 1075, 1088, 1104, 1142, 1155, 1161, 1166, 1193, 1204, 1207, 1214, 1216, 1236, 1278, 1279, 1284, 1301, 1302, 1336, 1338, 1346, 1368, 1408, 1411, 1415, 1428, 1503, 1526, 1540, 1547, 1552, 1560, 1587, 1590, 1622, 1623, ...], 'Tijuca': [15, 18, 20, 80, 82, 126, 145, 149, 158, 164, 176, 180, 182, 185, 197, 202, 258, 337, 342, 354, 363, 438, 450, 469, 479, 504, 513, 527, 565, 568, 598, 600, 627, 636, 637, 653, 674, 738, 743, 744, 762, 776, 788, 791, 794, 796, 811, 838, 841, 851, 871, 875, 885, 925, 947, 968, 974, 987, 990, 1020, 1031, 1038, 1061, 1119, 1178, 1181, 1198, 1263, 1277, 1372, 1431, 1435, 1457, 1479, 1530, 1534, 1563, 1565, 1574, 1581, 1634, 1638, 1658, 1679, 1702, 1704, 1718, 1729, 1751, 1778, 1782, 1790, 1820, 1830, 1831, 1836, 1867, 1877, 1900, 1911, ...]}

In [ ]:
for bairro, dados in grupo_bairro:
  print(dados)

                     Tipo           Bairro  ...  Valor m2  Tipo Agregado
5      Casa de Condomínio  Barra da Tijuca  ...     29.33           Casa
14            Apartamento  Barra da Tijuca  ...     25.37    Apartamento
16     Casa de Condomínio  Barra da Tijuca  ...     16.09           Casa
21            Apartamento  Barra da Tijuca  ...     24.00    Apartamento
30            Apartamento  Barra da Tijuca  ...     25.71    Apartamento
...                   ...              ...  ...       ...            ...
21801  Casa de Condomínio  Barra da Tijuca  ...     20.00           Casa
21811         Apartamento  Barra da Tijuca  ...     26.47    Apartamento
21812         Apartamento  Barra da Tijuca  ...     23.47    Apartamento
21813         Apartamento  Barra da Tijuca  ...     39.29    Apartamento
21820  Casa de Condomínio  Barra da Tijuca  ...     33.33           Casa

[3863 rows x 11 columns]
              Tipo    Bairro  Quartos  ...   IPTU  Valor m2  Tipo Agregado
23     Apartamento  Botafogo        2  ...    0.0     32.89    Apartamento
48     Apartamento  Botafogo        3  ...  289.0     55.09    Apartamento
87     Apartamento  Botafogo        2  ...  138.0     33.73    Apartamento
88     Apartamento  Botafogo        2  ...  187.0     53.75    Apartamento
111    Apartamento  Botafogo        3  ...  220.0     55.00    Apartamento
...            ...       ...      ...  ...    ...       ...            ...
21660  Apartamento  Botafogo        2  ...   75.0     31.67    Apartamento
21666  Apartamento  Botafogo        1  ...   26.0     39.22    Apartamento
21715  Apartamento  Botafogo        2  ...  330.0     59.62    Apartamento
21746  Apartamento  Botafogo        2  ...  260.0     50.36    Apartamento
21790  Apartamento  Botafogo        3  ...  205.0     45.00    Apartamento

[873 rows x 11 columns]
              Tipo      Bairro  Quartos  ...   IPTU  Valor m2  Tipo Agregado
0        Quitinete  Copacabana        1  ...   60.0     42.50    Apartamento
9      Apartamento  Copacabana        1  ...   50.0     50.00    Apartamento
10       Quitinete  Copacabana        1  ...    0.0     66.67    Apartamento
11     Apartamento  Copacabana        4  ...  803.0     53.50    Apartamento
24     Apartamento  Copacabana        3  ...  700.0     26.46    Apartamento
...            ...         ...      ...  ...    ...       ...            ...
21783  Apartamento  Copacabana        1  ...   78.0     40.00    Apartamento
21795  Apartamento  Copacabana        2  ...   80.0     36.57    Apartamento
21809  Apartamento  Copacabana        2  ...   90.0     58.57    Apartamento
21810  Apartamento  Copacabana        1  ...   70.0     39.00    Apartamento
21815    Quitinete  Copacabana        1  ...  200.0     68.18    Apartamento

[2644 rows x 11 columns]
              Tipo    Bairro  Quartos  ...    IPTU  Valor m2  Tipo Agregado
78       Quitinete  Flamengo        0  ...    53.0     35.71    Apartamento
138    Apartamento  Flamengo        1  ...    54.0     47.50    Apartamento
218    Apartamento  Flamengo        1  ...    70.0     43.75    Apartamento
284    Apartamento  Flamengo        2  ...  1150.0     31.76    Apartamento
321    Apartamento  Flamengo        2  ...    98.0     49.12    Apartamento
...            ...       ...      ...  ...     ...       ...            ...
21704  Apartamento  Flamengo        2  ...   131.0     22.08    Apartamento
21728    Quitinete  Flamengo        1  ...     0.0     39.13    Apartamento
21731  Apartamento  Flamengo        3  ...   386.0     30.77    Apartamento
21740  Apartamento  Flamengo        3  ...   130.0     30.43    Apartamento
21794  Apartamento  Flamengo        1  ...     0.0     45.83    Apartamento

[714 rows x 11 columns]
              Tipo   Bairro  Quartos  ...   IPTU  Valor m2  Tipo Agregado
19     Apartamento  Ipanema        3  ...  463.0     56.00    Apartamento
39     Apartamento  Ipanema        1  ...   75.0     57.14    Apartamento
40     Apartamento  Ipanema        1  ...   77.0     36.84    Apartamento
45     Apartamento  Ipanema        3  ...  217.0     36.78    Apartamento
52     Apartamento  Ipanema        3  ...    0.0     53.33    Apartamento
...            ...      ...      ...  ...    ...       ...            ...
21745  Apartamento  Ipanema        4  ...  538.0     59.11    Apartamento
21754  Apartamento  Ipanema        3  ...  850.0     51.43    Apartamento
21788  Apartamento  Ipanema        3  ...  250.0     50.85    Apartamento
21796  Apartamento  Ipanema        1  ...   19.0     36.36    Apartamento
21817  Apartamento  Ipanema        3  ...  600.0    100.00    Apartamento

[1764 rows x 11 columns]
              Tipo  Bairro  Quartos  ...    IPTU  Valor m2  Tipo Agregado
27     Apartamento  Leblon        3  ...   120.0     35.45    Apartamento
59     Apartamento  Leblon        2  ...   245.0     43.75    Apartamento
90     Apartamento  Leblon        3  ...   247.0     51.02    Apartamento
97     Apartamento  Leblon        3  ...  1211.0     45.88    Apartamento
115    Apartamento  Leblon        4  ...  1500.0    105.26    Apartamento
...            ...     ...      ...  ...     ...       ...            ...
21786  Apartamento  Leblon        3  ...   850.0     80.00    Apartamento
21787  Apartamento  Leblon        4  ...   770.0     35.71    Apartamento
21808  Apartamento  Leblon        1  ...   259.0     86.00    Apartamento
21816  Apartamento  Leblon        3  ...   249.0     37.50    Apartamento
21825  Apartamento  Leblon        2  ...     0.0     42.86    Apartamento

[1258 rows x 11 columns]
              Tipo  Bairro  Quartos  ...   IPTU  Valor m2  Tipo Agregado
15     Apartamento  Tijuca        2  ...  138.0     17.27    Apartamento
18     Apartamento  Tijuca        2  ...    0.0     25.64    Apartamento
20     Apartamento  Tijuca        1  ...   25.0     15.62    Apartamento
80     Apartamento  Tijuca        2  ...   84.0     22.50    Apartamento
82     Apartamento  Tijuca        3  ...  170.0     15.70    Apartamento
...            ...     ...      ...  ...    ...       ...            ...
21675  Apartamento  Tijuca        2  ...   62.0     23.08    Apartamento
21714  Apartamento  Tijuca        2  ...   62.0     24.64    Apartamento
21729  Apartamento  Tijuca        2  ...   45.0     24.00    Apartamento
21773  Apartamento  Tijuca        3  ...  141.0     25.33    Apartamento
21818  Apartamento  Tijuca        1  ...   25.0     35.71    Apartamento

[1100 rows x 11 columns]

In [ ]:
for bairro, dados in grupo_bairro:
  print(bairro)

Barra da Tijuca
Botafogo
Copacabana
Flamengo
Ipanema
Leblon
Tijuca

In [ ]:
for bairro, dados in grupo_bairro:
  print(type(dados))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.frame.DataFrame'>

In [ ]:
for bairro, dados in grupo_bairro:
  print(f'{bairro} -> {novas_variaveis.Valor.mean()}')

Barra da Tijuca -> 6432.60027832351
Botafogo -> 6432.60027832351
Copacabana -> 6432.60027832351
Flamengo -> 6432.60027832351
Ipanema -> 6432.60027832351
Leblon -> 6432.60027832351
Tijuca -> 6432.60027832351

In [ ]:
grupo_bairro[['Valor','Condominio']].mean().round(2)

                   Valor  Condominio
Bairro
Barra da Tijuca  7069.55     3591.01
Botafogo         8791.83      976.28
Copacabana       4126.68     1148.68
Flamengo         4113.53     1102.15
Ipanema          9352.00     2244.44
Leblon           8746.34     2107.18
Tijuca           2043.52      711.69